/* - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
Потрібно зробити перевірку якщо
кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
    Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.*/
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    document.write(`<h2>Це великий масив.</h2>`)
} else document.write(`<h2>Це маленький масив.</h2>`);

/*- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
    Знайти, яке з них є середнім (більше одного, але менше за інше).
     Перевірити, чи знаходиться перше число між двома іншими.*/

let a = 40;
let b = 25;
let c = 27;
if (b > a && b < c || b < a && b > c) {
    console.log(`${b} є поміж ${a} та ${c}`)
} else if (a > b && a < c || a < b && a > c) {
    console.log(`${a} є поміж ${b} та ${c}`)
} else if (c > b && c < a || c < b && c > a) {
    console.log(`${c} є поміж ${b} та ${a}`)
}

/*- Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
if (a + b < 4) {
    result = 'Мало';
} else {
    result = 'Багато';
}

*/
let a2 = 1;
let b2 = 2;
let result;
a2 + b2 < 4 ? result = 'Мало' : result = 'Багато';
console.log(result);
/*- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
напишіть це тернарним оператором*/
let testNumber = -22.3;
console.log(testNumber === 0 ? `Число ${testNumber} являється нулем` :
    testNumber < 0 ? `Число ${testNumber} являється негативним` : `Число ${testNumber} являється позитивним`);