/*- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код,
який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години).*/
let time = 32;
if (time >= 0 && time <= 15) {
    console.log(`${time} належить до 1 частини години.`)
} else if (time >= 16 && time <= 30) {
    console.log(`${time} належить до 2 частини години.`)
} else if (time >= 31 && time <= 45) {
    console.log(`${time} належить до 3 частини години.`)
} else if (time >= 46 && time <= 60) {
    console.log(`${time} належить до 4 частини години.`)
}


// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).
let decade = 13;
if (decade >= 1 && decade <= 10) {
    console.log(`${decade} належить до 1 декади.`)
} else if (decade >= 11 && decade <= 20) {
    console.log(`${decade} належить до 2 декади.`)
} else if (decade >= 21 && decade <= 31) {
    console.log(`${decade} належить до 3 декади.`)
}


/* - У нас є змінна test не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта
     - з коротким записом(тернаркою)
*/
let test = false;
console.log(test  ? 'Вірно' : 'Неправильно');


/*
- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
 Перевірте  скрипт при a, що дорівнює 1, 0, -3
 */
let a = 0;
let testA = (a) => console.log(a === 0 ? 'Вірно' : 'Невірно');
testA(a);
a = 1;
testA(a);
a = -3;
testA(a);

/*
- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня
 і на екрані відображається інфа що заплановано на цей день.*/
switch (8) {
    case 1:
        console.log('День 1: 20:00 Лекція JS');
        break;
    case 2:
        console.log('День 2: 20:00 Практика JS');
        break;
    case 3:
        console.log('День 3: 20:00 Лекція JS');
        break;
    case 4:
        console.log('День 4: 20:00 Практика JS');
        break;
    case 5:
        console.log('День 5: 20:00 Лекція JS');
        break;
    case 6:
        console.log('День 6: 10:00 Англійська');
        break;
    case 7:
        console.log('День 7: 10:00-20:00 Самонавчання');
        break;
    default:
        console.log('Такого дня тижня не має!');
}


/*
- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
*/
// let year = 365;
// let checkYear = (year) =>
//     year===366 ||year=== 365 ? console.log((year % 2 === 0) ? 'Рік високосний 366' : 'Рік не високосний') : console.log('Введіть значення 365 або 366');



let year = 2021;
let checkYear = (year) =>
    (year % 4 === 0) ? console.log('Рік високосний ') : console.log('Рік не високосний');
checkYear(year);
/*

- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
*/
if(prompt('Яка «офіційна» назва JavaScript?')==='ECMAScript'){console.log('Правильно')
}else console.log('Не знаєте? ECMAScript!');